MikroElektronika/core_packages/PIC/XC8/def/PIC12HV752/mcu.h
extern volatile C1CON1bits_t C1CON1bits __at(0x09E);
// bitfield macros
#define _C1CON1_C1NCH0_POSN                                 0x0
#define _C1CON1_C1NCH0_POSITION                             0x0
#define _C1CON1_C1NCH0_SIZE                                 0x1
#define _C1CON1_C1NCH0_LENGTH                               0x1
#define _C1CON1_C1NCH0_MASK                                 0x1
#define _C1CON1_C1PCH_POSN                                  0x4
#define _C1CON1_C1PCH_POSITION                              0x4
#define _C1CON1_C1PCH_SIZE                                  0x2
#define _C1CON1_C1PCH_LENGTH                                0x2
#define _C1CON1_C1PCH_MASK                                  0x30
#define _C1CON1_C1INTN_POSN                                 0x6
#define _C1CON1_C1INTN_POSITION                             0x6
#define _C1CON1_C1INTN_SIZE                                 0x1
#define _C1CON1_C1INTN_LENGTH                               0x1
#define _C1CON1_C1INTN_MASK                                 0x40
#define _C1CON1_C1INTP_POSN                                 0x7
#define _C1CON1_C1INTP_POSITION                             0x7
#define _C1CON1_C1INTP_SIZE                                 0x1
#define _C1CON1_C1INTP_LENGTH                               0x1
#define _C1CON1_C1INTP_MASK                                 0x80
#define _C1CON1_C1PCH0_POSN                                 0x4
#define _C1CON1_C1PCH0_POSITION                             0x4
#define _C1CON1_C1PCH0_SIZE                                 0x1
#define _C1CON1_C1PCH0_LENGTH                               0x1
#define _C1CON1_C1PCH0_MASK                                 0x10
#define _C1CON1_C1PCH1_POSN                                 0x5
#define _C1CON1_C1PCH1_POSITION                             0x5
#define _C1CON1_C1PCH1_SIZE                                 0x1
#define _C1CON1_C1PCH1_LENGTH                               0x1
#define _C1CON1_C1PCH1_MASK                                 0x20

// Register: CMOUT
#define CMOUT CMOUT
extern volatile unsigned char           CMOUT               __at(0x09F);
#ifndef _LIB_BUILD
asm("CMOUT equ 09Fh");
#endif
// aliases
extern volatile unsigned char           MCOUT               __at(0x09F);
#ifndef _LIB_BUILD
asm("MCOUT equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MCOUT1                 :1;
        unsigned MCOUT2                 :1;
    };
} CMOUTbits_t;
extern volatile CMOUTbits_t CMOUTbits __at(0x09F);
// bitfield macros
#define _CMOUT_MCOUT1_POSN                                  0x0
#define _CMOUT_MCOUT1_POSITION                              0x0
#define _CMOUT_MCOUT1_SIZE                                  0x1
#define _CMOUT_MCOUT1_LENGTH                                0x1
#define _CMOUT_MCOUT1_MASK                                  0x1
#define _CMOUT_MCOUT2_POSN                                  0x1
#define _CMOUT_MCOUT2_POSITION                              0x1
#define _CMOUT_MCOUT2_SIZE                                  0x1
#define _CMOUT_MCOUT2_LENGTH                                0x1
#define _CMOUT_MCOUT2_MASK                                  0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned MCOUT1                 :1;
        unsigned MCOUT2                 :1;
    };
} MCOUTbits_t;
extern volatile MCOUTbits_t MCOUTbits __at(0x09F);
// bitfield macros
#define _MCOUT_MCOUT1_POSN                                  0x0
#define _MCOUT_MCOUT1_POSITION                              0x0
#define _MCOUT_MCOUT1_SIZE                                  0x1
#define _MCOUT_MCOUT1_LENGTH                                0x1
#define _MCOUT_MCOUT1_MASK                                  0x1
#define _MCOUT_MCOUT2_POSN                                  0x1
#define _MCOUT_MCOUT2_POSITION                              0x1
#define _MCOUT_MCOUT2_SIZE                                  0x1
#define _MCOUT_MCOUT2_LENGTH                                0x1
#define _MCOUT_MCOUT2_MASK                                  0x2

// Register: LATA
#define LATA LATA
extern volatile unsigned char           LATA                __at(0x105);
#ifndef _LIB_BUILD
asm("LATA equ 0105h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATA0                  :1;
        unsigned LATA1                  :1;
        unsigned LATA2                  :1;
        unsigned                        :1;
        unsigned LATA4                  :1;
        unsigned LATA5                  :1;
    };
} LATAbits_t;
extern volatile LATAbits_t LATAbits __at(0x105);
// bitfield macros
#define _LATA_LATA0_POSN                                    0x0
#define _LATA_LATA0_POSITION                                0x0
#define _LATA_LATA0_SIZE                                    0x1
#define _LATA_LATA0_LENGTH                                  0x1
#define _LATA_LATA0_MASK                                    0x1
#define _LATA_LATA1_POSN                                    0x1
#define _LATA_LATA1_POSITION                                0x1
#define _LATA_LATA1_SIZE                                    0x1
#define _LATA_LATA1_LENGTH                                  0x1
#define _LATA_LATA1_MASK                                    0x2
#define _LATA_LATA2_POSN                                    0x2
#define _LATA_LATA2_POSITION                                0x2
#define _LATA_LATA2_SIZE                                    0x1
#define _LATA_LATA2_LENGTH                                  0x1
#define _LATA_LATA2_MASK                                    0x4
#define _LATA_LATA4_POSN                                    0x4
#define _LATA_LATA4_POSITION                                0x4
#define _LATA_LATA4_SIZE                                    0x1
#define _LATA_LATA4_LENGTH                                  0x1
#define _LATA_LATA4_MASK                                    0x10
#define _LATA_LATA5_POSN                                    0x5
#define _LATA_LATA5_POSITION                                0x5
#define _LATA_LATA5_SIZE                                    0x1
#define _LATA_LATA5_LENGTH                                  0x1
#define _LATA_LATA5_MASK                                    0x20

// Register: IOCAN
#define IOCAN IOCAN
extern volatile unsigned char           IOCAN               __at(0x108);
#ifndef _LIB_BUILD
asm("IOCAN equ 0108h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAN0                 :1;
        unsigned IOCAN1                 :1;
        unsigned IOCAN2                 :1;
        unsigned IOCAN3                 :1;
        unsigned IOCAN4                 :1;
        unsigned IOCAN5                 :1;
    };
} IOCANbits_t;
extern volatile IOCANbits_t IOCANbits __at(0x108);
// bitfield macros
#define _IOCAN_IOCAN0_POSN                                  0x0
#define _IOCAN_IOCAN0_POSITION                              0x0
#define _IOCAN_IOCAN0_SIZE                                  0x1
#define _IOCAN_IOCAN0_LENGTH                                0x1
#define _IOCAN_IOCAN0_MASK                                  0x1
#define _IOCAN_IOCAN1_POSN                                  0x1
#define _IOCAN_IOCAN1_POSITION                              0x1
#define _IOCAN_IOCAN1_SIZE                                  0x1
#define _IOCAN_IOCAN1_LENGTH                                0x1
#define _IOCAN_IOCAN1_MASK                                  0x2
#define _IOCAN_IOCAN2_POSN                                  0x2
#define _IOCAN_IOCAN2_POSITION                              0x2
#define _IOCAN_IOCAN2_SIZE                                  0x1
#define _IOCAN_IOCAN2_LENGTH                                0x1
#define _IOCAN_IOCAN2_MASK                                  0x4
#define _IOCAN_IOCAN3_POSN                                  0x3
#define _IOCAN_IOCAN3_POSITION                              0x3
#define _IOCAN_IOCAN3_SIZE                                  0x1
#define _IOCAN_IOCAN3_LENGTH                                0x1
#define _IOCAN_IOCAN3_MASK                                  0x8
#define _IOCAN_IOCAN4_POSN                                  0x4
#define _IOCAN_IOCAN4_POSITION                              0x4
#define _IOCAN_IOCAN4_SIZE                                  0x1
#define _IOCAN_IOCAN4_LENGTH                                0x1
#define _IOCAN_IOCAN4_MASK                                  0x10
#define _IOCAN_IOCAN5_POSN                                  0x5
#define _IOCAN_IOCAN5_POSITION                              0x5
#define _IOCAN_IOCAN5_SIZE                                  0x1
#define _IOCAN_IOCAN5_LENGTH                                0x1
#define _IOCAN_IOCAN5_MASK                                  0x20

