MikroElektronika/core_packages/PIC/XC8/def/PIC12HV752/mcu.h
// Register: PMDATH
#define PMDATH PMDATH
extern volatile unsigned char           PMDATH              __at(0x191);
#ifndef _LIB_BUILD
asm("PMDATH equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMDATH                 :6;
    };
} PMDATHbits_t;
extern volatile PMDATHbits_t PMDATHbits __at(0x191);
// bitfield macros
#define _PMDATH_PMDATH_POSN                                 0x0
#define _PMDATH_PMDATH_POSITION                             0x0
#define _PMDATH_PMDATH_SIZE                                 0x6
#define _PMDATH_PMDATH_LENGTH                               0x6
#define _PMDATH_PMDATH_MASK                                 0x3F

// Register: COG1PH
#define COG1PH COG1PH
extern volatile unsigned char           COG1PH              __at(0x192);
#ifndef _LIB_BUILD
asm("COG1PH equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1PH                   :4;
    };
    struct {
        unsigned G1PH0                  :1;
        unsigned G1PH1                  :1;
        unsigned G1PH2                  :1;
        unsigned G1PH3                  :1;
    };
} COG1PHbits_t;
extern volatile COG1PHbits_t COG1PHbits __at(0x192);
// bitfield macros
#define _COG1PH_G1PH_POSN                                   0x0
#define _COG1PH_G1PH_POSITION                               0x0
#define _COG1PH_G1PH_SIZE                                   0x4
#define _COG1PH_G1PH_LENGTH                                 0x4
#define _COG1PH_G1PH_MASK                                   0xF
#define _COG1PH_G1PH0_POSN                                  0x0
#define _COG1PH_G1PH0_POSITION                              0x0
#define _COG1PH_G1PH0_SIZE                                  0x1
#define _COG1PH_G1PH0_LENGTH                                0x1
#define _COG1PH_G1PH0_MASK                                  0x1
#define _COG1PH_G1PH1_POSN                                  0x1
#define _COG1PH_G1PH1_POSITION                              0x1
#define _COG1PH_G1PH1_SIZE                                  0x1
#define _COG1PH_G1PH1_LENGTH                                0x1
#define _COG1PH_G1PH1_MASK                                  0x2
#define _COG1PH_G1PH2_POSN                                  0x2
#define _COG1PH_G1PH2_POSITION                              0x2
#define _COG1PH_G1PH2_SIZE                                  0x1
#define _COG1PH_G1PH2_LENGTH                                0x1
#define _COG1PH_G1PH2_MASK                                  0x4
#define _COG1PH_G1PH3_POSN                                  0x3
#define _COG1PH_G1PH3_POSITION                              0x3
#define _COG1PH_G1PH3_SIZE                                  0x1
#define _COG1PH_G1PH3_LENGTH                                0x1
#define _COG1PH_G1PH3_MASK                                  0x8

// Register: COG1BLK
#define COG1BLK COG1BLK
extern volatile unsigned char           COG1BLK             __at(0x193);
#ifndef _LIB_BUILD
asm("COG1BLK equ 0193h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1BLKF                 :4;
        unsigned G1BLKR                 :4;
    };
    struct {
        unsigned G1BLKF0                :1;
        unsigned G1BLKF1                :1;
        unsigned G1BLKF2                :1;
        unsigned G1BLKF3                :1;
        unsigned G1BLKR0                :1;
        unsigned G1BLKR1                :1;
        unsigned G1BLKR2                :1;
        unsigned G1BLKR3                :1;
    };
} COG1BLKbits_t;
extern volatile COG1BLKbits_t COG1BLKbits __at(0x193);
// bitfield macros
#define _COG1BLK_G1BLKF_POSN                                0x0
#define _COG1BLK_G1BLKF_POSITION                            0x0
#define _COG1BLK_G1BLKF_SIZE                                0x4
#define _COG1BLK_G1BLKF_LENGTH                              0x4
#define _COG1BLK_G1BLKF_MASK                                0xF
#define _COG1BLK_G1BLKR_POSN                                0x4
#define _COG1BLK_G1BLKR_POSITION                            0x4
#define _COG1BLK_G1BLKR_SIZE                                0x4
#define _COG1BLK_G1BLKR_LENGTH                              0x4
#define _COG1BLK_G1BLKR_MASK                                0xF0
#define _COG1BLK_G1BLKF0_POSN                               0x0
#define _COG1BLK_G1BLKF0_POSITION                           0x0
#define _COG1BLK_G1BLKF0_SIZE                               0x1
#define _COG1BLK_G1BLKF0_LENGTH                             0x1
#define _COG1BLK_G1BLKF0_MASK                               0x1
#define _COG1BLK_G1BLKF1_POSN                               0x1
#define _COG1BLK_G1BLKF1_POSITION                           0x1
#define _COG1BLK_G1BLKF1_SIZE                               0x1
#define _COG1BLK_G1BLKF1_LENGTH                             0x1
#define _COG1BLK_G1BLKF1_MASK                               0x2
#define _COG1BLK_G1BLKF2_POSN                               0x2
#define _COG1BLK_G1BLKF2_POSITION                           0x2
#define _COG1BLK_G1BLKF2_SIZE                               0x1
#define _COG1BLK_G1BLKF2_LENGTH                             0x1
#define _COG1BLK_G1BLKF2_MASK                               0x4
#define _COG1BLK_G1BLKF3_POSN                               0x3
#define _COG1BLK_G1BLKF3_POSITION                           0x3
#define _COG1BLK_G1BLKF3_SIZE                               0x1
#define _COG1BLK_G1BLKF3_LENGTH                             0x1
#define _COG1BLK_G1BLKF3_MASK                               0x8
#define _COG1BLK_G1BLKR0_POSN                               0x4
#define _COG1BLK_G1BLKR0_POSITION                           0x4
#define _COG1BLK_G1BLKR0_SIZE                               0x1
#define _COG1BLK_G1BLKR0_LENGTH                             0x1
#define _COG1BLK_G1BLKR0_MASK                               0x10
#define _COG1BLK_G1BLKR1_POSN                               0x5
#define _COG1BLK_G1BLKR1_POSITION                           0x5
#define _COG1BLK_G1BLKR1_SIZE                               0x1
#define _COG1BLK_G1BLKR1_LENGTH                             0x1
#define _COG1BLK_G1BLKR1_MASK                               0x20
#define _COG1BLK_G1BLKR2_POSN                               0x6
#define _COG1BLK_G1BLKR2_POSITION                           0x6
#define _COG1BLK_G1BLKR2_SIZE                               0x1
#define _COG1BLK_G1BLKR2_LENGTH                             0x1
#define _COG1BLK_G1BLKR2_MASK                               0x40
#define _COG1BLK_G1BLKR3_POSN                               0x7
#define _COG1BLK_G1BLKR3_POSITION                           0x7
#define _COG1BLK_G1BLKR3_SIZE                               0x1
#define _COG1BLK_G1BLKR3_LENGTH                             0x1
#define _COG1BLK_G1BLKR3_MASK                               0x80

