MikroElektronika/core_packages/PIC/XC8/def/PIC12HV752/mcu.h
// Register: COG1DB
#define COG1DB COG1DB
extern volatile unsigned char           COG1DB              __at(0x194);
#ifndef _LIB_BUILD
asm("COG1DB equ 0194h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1DBF                  :4;
        unsigned G1DBR                  :4;
    };
    struct {
        unsigned G1DBF0                 :1;
        unsigned G1DBF1                 :1;
        unsigned G1DBF2                 :1;
        unsigned G1DBF3                 :1;
        unsigned G1BDR0                 :1;
        unsigned G1BDR1                 :1;
        unsigned G1BDR2                 :1;
        unsigned G1BDR3                 :1;
    };
} COG1DBbits_t;
extern volatile COG1DBbits_t COG1DBbits __at(0x194);
// bitfield macros
#define _COG1DB_G1DBF_POSN                                  0x0
#define _COG1DB_G1DBF_POSITION                              0x0
#define _COG1DB_G1DBF_SIZE                                  0x4
#define _COG1DB_G1DBF_LENGTH                                0x4
#define _COG1DB_G1DBF_MASK                                  0xF
#define _COG1DB_G1DBR_POSN                                  0x4
#define _COG1DB_G1DBR_POSITION                              0x4
#define _COG1DB_G1DBR_SIZE                                  0x4
#define _COG1DB_G1DBR_LENGTH                                0x4
#define _COG1DB_G1DBR_MASK                                  0xF0
#define _COG1DB_G1DBF0_POSN                                 0x0
#define _COG1DB_G1DBF0_POSITION                             0x0
#define _COG1DB_G1DBF0_SIZE                                 0x1
#define _COG1DB_G1DBF0_LENGTH                               0x1
#define _COG1DB_G1DBF0_MASK                                 0x1
#define _COG1DB_G1DBF1_POSN                                 0x1
#define _COG1DB_G1DBF1_POSITION                             0x1
#define _COG1DB_G1DBF1_SIZE                                 0x1
#define _COG1DB_G1DBF1_LENGTH                               0x1
#define _COG1DB_G1DBF1_MASK                                 0x2
#define _COG1DB_G1DBF2_POSN                                 0x2
#define _COG1DB_G1DBF2_POSITION                             0x2
#define _COG1DB_G1DBF2_SIZE                                 0x1
#define _COG1DB_G1DBF2_LENGTH                               0x1
#define _COG1DB_G1DBF2_MASK                                 0x4
#define _COG1DB_G1DBF3_POSN                                 0x3
#define _COG1DB_G1DBF3_POSITION                             0x3
#define _COG1DB_G1DBF3_SIZE                                 0x1
#define _COG1DB_G1DBF3_LENGTH                               0x1
#define _COG1DB_G1DBF3_MASK                                 0x8
#define _COG1DB_G1BDR0_POSN                                 0x4
#define _COG1DB_G1BDR0_POSITION                             0x4
#define _COG1DB_G1BDR0_SIZE                                 0x1
#define _COG1DB_G1BDR0_LENGTH                               0x1
#define _COG1DB_G1BDR0_MASK                                 0x10
#define _COG1DB_G1BDR1_POSN                                 0x5
#define _COG1DB_G1BDR1_POSITION                             0x5
#define _COG1DB_G1BDR1_SIZE                                 0x1
#define _COG1DB_G1BDR1_LENGTH                               0x1
#define _COG1DB_G1BDR1_MASK                                 0x20
#define _COG1DB_G1BDR2_POSN                                 0x6
#define _COG1DB_G1BDR2_POSITION                             0x6
#define _COG1DB_G1BDR2_SIZE                                 0x1
#define _COG1DB_G1BDR2_LENGTH                               0x1
#define _COG1DB_G1BDR2_MASK                                 0x40
#define _COG1DB_G1BDR3_POSN                                 0x7
#define _COG1DB_G1BDR3_POSITION                             0x7
#define _COG1DB_G1BDR3_SIZE                                 0x1
#define _COG1DB_G1BDR3_LENGTH                               0x1
#define _COG1DB_G1BDR3_MASK                                 0x80

// Register: COG1CON0
#define COG1CON0 COG1CON0
extern volatile unsigned char           COG1CON0            __at(0x195);
#ifndef _LIB_BUILD
asm("COG1CON0 equ 0195h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1CS                   :2;
        unsigned G1LD                   :1;
        unsigned G1POL0                 :1;
        unsigned G1POL1                 :1;
        unsigned G1OE0                  :1;
        unsigned G1OE1                  :1;
        unsigned G1EN                   :1;
    };
    struct {
        unsigned G1CS0                  :1;
        unsigned G1CS1                  :1;
    };
} COG1CON0bits_t;
extern volatile COG1CON0bits_t COG1CON0bits __at(0x195);
// bitfield macros
#define _COG1CON0_G1CS_POSN                                 0x0
#define _COG1CON0_G1CS_POSITION                             0x0
#define _COG1CON0_G1CS_SIZE                                 0x2
#define _COG1CON0_G1CS_LENGTH                               0x2
#define _COG1CON0_G1CS_MASK                                 0x3
#define _COG1CON0_G1LD_POSN                                 0x2
#define _COG1CON0_G1LD_POSITION                             0x2
#define _COG1CON0_G1LD_SIZE                                 0x1
#define _COG1CON0_G1LD_LENGTH                               0x1
#define _COG1CON0_G1LD_MASK                                 0x4
#define _COG1CON0_G1POL0_POSN                               0x3
#define _COG1CON0_G1POL0_POSITION                           0x3
#define _COG1CON0_G1POL0_SIZE                               0x1
#define _COG1CON0_G1POL0_LENGTH                             0x1
#define _COG1CON0_G1POL0_MASK                               0x8
#define _COG1CON0_G1POL1_POSN                               0x4
#define _COG1CON0_G1POL1_POSITION                           0x4
#define _COG1CON0_G1POL1_SIZE                               0x1
#define _COG1CON0_G1POL1_LENGTH                             0x1
#define _COG1CON0_G1POL1_MASK                               0x10
#define _COG1CON0_G1OE0_POSN                                0x5
#define _COG1CON0_G1OE0_POSITION                            0x5
#define _COG1CON0_G1OE0_SIZE                                0x1
#define _COG1CON0_G1OE0_LENGTH                              0x1
#define _COG1CON0_G1OE0_MASK                                0x20
#define _COG1CON0_G1OE1_POSN                                0x6
#define _COG1CON0_G1OE1_POSITION                            0x6
#define _COG1CON0_G1OE1_SIZE                                0x1
#define _COG1CON0_G1OE1_LENGTH                              0x1
#define _COG1CON0_G1OE1_MASK                                0x40
#define _COG1CON0_G1EN_POSN                                 0x7
#define _COG1CON0_G1EN_POSITION                             0x7
#define _COG1CON0_G1EN_SIZE                                 0x1
#define _COG1CON0_G1EN_LENGTH                               0x1
#define _COG1CON0_G1EN_MASK                                 0x80
#define _COG1CON0_G1CS0_POSN                                0x0
#define _COG1CON0_G1CS0_POSITION                            0x0
#define _COG1CON0_G1CS0_SIZE                                0x1
#define _COG1CON0_G1CS0_LENGTH                              0x1
#define _COG1CON0_G1CS0_MASK                                0x1
#define _COG1CON0_G1CS1_POSN                                0x1
#define _COG1CON0_G1CS1_POSITION                            0x1
#define _COG1CON0_G1CS1_SIZE                                0x1
#define _COG1CON0_G1CS1_LENGTH                              0x1
#define _COG1CON0_G1CS1_MASK                                0x2

// Register: COG1CON1
#define COG1CON1 COG1CON1
extern volatile unsigned char           COG1CON1            __at(0x196);
#ifndef _LIB_BUILD
asm("COG1CON1 equ 0196h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1RS                   :3;
        unsigned G1FS                   :3;
        unsigned G1RSIM                 :1;
        unsigned G1FSIM                 :1;
    };
    struct {
        unsigned G1RS0                  :1;
        unsigned G1RS1                  :1;
        unsigned G1RS2                  :1;
        unsigned G1FS0                  :1;
        unsigned G1FS1                  :1;
        unsigned G1FS2                  :1;
    };
} COG1CON1bits_t;
